InformationRegisters/абс_НастройкиСогласованияДокументов/абс_НастройкиСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиСогласованияДокументов</name>
  <comment>Настройки согласования документов</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_НастройкиНачалаМаршрутовСогласованияДокументов/абс_НастройкиНачалаМаршрутовСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_НастройкиНачалаМаршрутовСогласованияДокументов</name>
  <comment>Настройки начала маршрутов согласования документов</comment>
  <resources>
    <name>МаршрутСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияДляЗРССверхЛимита</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <resources>
    <name>МаршрутСогласованияСрочныеЗРС</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_ТипыДокументовДляСогласования/абс_ТипыДокументовДляСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыДокументовДляСогласования</name>
  <enumValues>
    <name>ВводБюджета</name>
  </enumValues>
  <enumValues>
    <name>СтратегическиеЦелиПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПланПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРасходованиеСредств</name>
  </enumValues>
  <enumValues>
    <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаОбразцы</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаЗапчасти</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаАкцию</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураПолученный</name>
  </enumValues>
</mdclass:Enum>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Documents/абс_ЗаявкаНаБюджетОтделаТМ/абс_ЗаявкаНаБюджетОтделаТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаБюджетОтделаТМ</name>
  <registerRecords>AccumulationRegister.абс_БюджетОтделаТМ</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкиНаБюджетТМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОтнесенияЗатрат</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаБюджета</name>
    <type>
      <types>CatalogRef.абс_АналитикиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_СтратегическиеЦелиПродаж/абс_СтратегическиеЦелиПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СтратегическиеЦелиПродаж</name>
  <registerRecords>InformationRegister.абс_СтратегическиеЦелиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.абс_ЦелиПродаж</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПлана</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТочекПродаж</name>
      <comment>Общее количество точек продаж</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АКБ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоАртикулов</name>
      <comment>Среднее количество артикулов</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Территория</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>CatalogRef.Регионы</types>
      </type>
    </attributes>
    <attributes>
      <name>Канал</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоЧисленнойДистрибуции</name>
      <comment>Общее количество точек в которых есть хотя бы одна позиция марки Леовит</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА1</name>
      <comment>Количество точек содержащих фокусный ассортимент 1 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА2</name>
      <comment>Количество точек содержащих фокусный ассортимент 2 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА3</name>
      <comment>Количество точек содержащих фокусный ассортимент 3 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦельПоДистрибуцииФА4</name>
      <comment>Количество точек содержащих фокусный ассортимент 4 уровня</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Catalogs/МаршрутыСогласования/МаршрутыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МаршрутыСогласования</name>
  <comment>Маршруты согласования заявок на расходование денежных средств (Не используется)</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <tabularSections>
    <name>СогласующиеЛица</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CommonModules/абс_СогласованиеДокументов/Module.bsl
//Функция определяет, используется ли функционал согласования документов по указанной организации на указанную дату
Функция ИспользуетсяСогласованиеДокументов(ТекОрганизация, ТипДокументаДляСогласования, ТекДата) Экспорт
	Если НЕ ЗначениеЗаполнено(ТекДата) ИЛИ НЕ ЗначениеЗаполнено(ТипДокументаДляСогласования) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	абс_НастройкиСогласованияДокументовСрезПоследних.ТипДокументаДляСогласования
	|ИЗ
	|	РегистрСведений.абс_НастройкиСогласованияДокументов.СрезПоследних(
	|			&ТекДата,
	|			Организация = &текОрганизация
	|				И ТипДокументаДляСогласования = &ТипДокументаДляСогласования) КАК абс_НастройкиСогласованияДокументовСрезПоследних";
	Запрос.УстановитьПараметр("текОрганизация", ТекОрганизация);
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования", ТипДокументаДляСогласования);
	Запрос.УстановитьПараметр("текДата", ТекДата);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

//Функция определяет маршрут согласования документа по подразделению
Функция ОпределитьМаршрутСогласования(Подразделение,ТипДокументаДляСогласования,ЗРССверхЛимита = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЗРССверхЛимита
	|				И &ТипДокументаДляСогласования = ЗНАЧЕНИЕ(Перечисление.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств)
	|				И НЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.ПустаяСсылка)
	|			ТОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита
	|		ИНАЧЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования
	|	КОНЕЦ КАК МаршрутСогласования,
	|	ВЫБОР
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 0
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 1
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	(абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|			ИЛИ абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение)
	|	И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("ТекПодразделение"			, Подразделение);
	Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, ТипДокументаДляСогласования);
	Запрос.УстановитьПараметр("ЗРССверхЛимита"				, ЗРССверхЛимита);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
	
КонецФункции

//Функция определяет маршрут согласования документа по подразделению
Функция Лео_ОпределитьМаршрутСогласованияЗаявокНаРасходованиеДС(Источник) Экспорт
	
	Если НЕ ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.Лео_ЗаявкаНаОбразцы") Тогда
		Если Источник.РасшифровкаПлатежа.Количество() > 0 Тогда
			СтатьяДс = Источник.РасшифровкаПлатежа[0].СтатьяДвиженияДенежныхСредств;
		Иначе
			СтатьяДс = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
		КонецЕсли;
	Иначе
		СтатьяДс = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СрочныеЗРС
	|				И &ТипДокументаДляСогласования = ЗНАЧЕНИЕ(Перечисление.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств)
	|				И НЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияСрочныеЗРС = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.ПустаяСсылка)
	|			ТОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияСрочныеЗРС
	|		КОГДА &ЗРССверхЛимита
	|				И &ТипДокументаДляСогласования = ЗНАЧЕНИЕ(Перечисление.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств)
	|				И НЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.ПустаяСсылка)
	|			ТОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита
	|		ИНАЧЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования
	|	КОНЕЦ КАК МаршрутСогласования,
	|	ВЫБОР
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 0
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 1
	|	КОНЕЦ КАК ПриоритетПодразделений,
	|	ВЫБОР
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ТекСтатьяДС
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 0
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ПустаяСтатьяДС
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 1
	|	КОНЕЦ КАК ПриоритетСтатьи
	|ПОМЕСТИТЬ ВТ_Исходная
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	(абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|			ИЛИ абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение)
	|	И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|	И (абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ТекСтатьяДС
	|			ИЛИ абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ПустаяСтатьяДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Исходная.МаршрутСогласования,
	|	ВТ_Исходная.ПриоритетПодразделений * 10 + ВТ_Исходная.ПриоритетСтатьи КАК Приоритет
	|ИЗ
	|	ВТ_Исходная КАК ВТ_Исходная
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("ТекПодразделение"			, Источник.ЦФО);
	Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств);
	Запрос.УстановитьПараметр("ЗРССверхЛимита"				, Источник.абс_СверхЛимита);
	Запрос.УстановитьПараметр("ТекСтатьяДС"                 , СтатьяДс);
	Запрос.УстановитьПараметр("ПустаяСтатьяДС"              , Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	Запрос.УстановитьПараметр("СрочныеЗРС"                  , Источник.Лео_Срочная);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
	
КонецФункции

//Функция определяет маршрут согласования документа по подразделению
Функция Лео_ОпределитьМаршрутСогласованияЗаявкаНаОбразцы(Источник) Экспорт
	
	СтатьяДс = Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &СрочныеЗРС
	|				И &ТипДокументаДляСогласования = ЗНАЧЕНИЕ(Перечисление.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств)
	|				И НЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияСрочныеЗРС = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.ПустаяСсылка)
	|			ТОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияСрочныеЗРС
	|		КОГДА &ЗРССверхЛимита
	|				И &ТипДокументаДляСогласования = ЗНАЧЕНИЕ(Перечисление.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств)
	|				И НЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита = ЗНАЧЕНИЕ(Справочник.абс_МаршрутыСогласованияДокументов.ПустаяСсылка)
	|			ТОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласованияДляЗРССверхЛимита
	|		ИНАЧЕ абс_НастройкиНачалаМаршрутовСогласованияДокументов.МаршрутСогласования
	|	КОНЕЦ КАК МаршрутСогласования,
	|	ВЫБОР
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 0
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 1
	|	КОНЕЦ КАК ПриоритетПодразделений,
	|	ВЫБОР
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ТекСтатьяДС
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 0
	|		КОГДА абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ПустаяСтатьяДС
	|				И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|			ТОГДА 1
	|	КОНЕЦ КАК ПриоритетСтатьи
	|ПОМЕСТИТЬ ВТ_Исходная
	|ИЗ
	|	РегистрСведений.абс_НастройкиНачалаМаршрутовСогласованияДокументов КАК абс_НастройкиНачалаМаршрутовСогласованияДокументов
	|ГДЕ
	|	(абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ТекПодразделение
	|			ИЛИ абс_НастройкиНачалаМаршрутовСогласованияДокументов.Подразделение = &ПустоеПодразделение)
	|	И абс_НастройкиНачалаМаршрутовСогласованияДокументов.ТипДокументаДляСогласования = &ТипДокументаДляСогласования
	|	И (абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ТекСтатьяДС
	|			ИЛИ абс_НастройкиНачалаМаршрутовСогласованияДокументов.СтатьяДвиженияДенежныхСредств = &ПустаяСтатьяДС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Исходная.МаршрутСогласования,
	|	ВТ_Исходная.ПриоритетПодразделений * 10 + ВТ_Исходная.ПриоритетСтатьи КАК Приоритет
	|ИЗ
	|	ВТ_Исходная КАК ВТ_Исходная
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет");
	
	Запрос.УстановитьПараметр("ТекПодразделение"			, Источник.Подразделение);
	Запрос.УстановитьПараметр("ПустоеПодразделение"			, Справочники.Подразделения.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипДокументаДляСогласования"	, Перечисления.абс_ТипыДокументовДляСогласования.Лео_ЗаявкаНаОбразцы);
	Запрос.УстановитьПараметр("ЗРССверхЛимита"				, Ложь);
	Запрос.УстановитьПараметр("ТекСтатьяДС"                 , СтатьяДс);
	Запрос.УстановитьПараметр("ПустаяСтатьяДС"              , Справочники.СтатьиДвиженияДенежныхСредств.ПустаяСсылка());
	Запрос.УстановитьПараметр("СрочныеЗРС"                  , Ложь);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.МаршрутСогласования;
	КонецЕсли;
	
	Возврат Справочники.МаршрутыСогласования.ПустаяСсылка();
	
КонецФункции

//процедура устанавливает для новых документов, учавстующих в согласовании, значения реквизитов ЭтапСогласования и УровеньСогласования
Процедура абс_ПередЗаписьюДокументаСогласованияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ТипЗнч(Источник)=Тип("ДокументОбъект.ЗаявкаНаРасходованиеСредств") Тогда
		Если УправлениеДенежнымиСредствами.ИспользуетсяСогласованиеЗаявок(Источник.Организация, Источник.Дата) Тогда
			Если Источник.ЭтоНовый() Тогда
				МаршрутСогласования=абс_СогласованиеДокументов.Лео_ОпределитьМаршрутСогласованияЗаявокНаРасходованиеДС(Источник);
				Если Не МаршрутСогласования.Пустая() Тогда 
					Источник.абс_ЭтапСогласования=МаршрутСогласования;
					Источник.абс_УровеньСогласования=МаршрутСогласования.Уровень() + 1;
				КонецЕсли;
			Иначе
				Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник.абс_ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
					Источник.абс_УровеньСогласования=0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.ПланПродаж") Тогда
		Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Источник.Организация,Перечисления.абс_ТипыДокументовДляСогласования.ПланПродаж,Источник.Дата) Тогда
			Если Источник.ЭтоНовый() Тогда
				МаршрутСогласования=абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Неопределено,Перечисления.абс_ТипыДокументовДляСогласования.ПланПродаж);
				Если Не МаршрутСогласования.Пустая() Тогда 
					Источник.абс_ЭтапСогласования=МаршрутСогласования;
					Источник.абс_УровеньСогласования=МаршрутСогласования.Уровень() + 1;
				КонецЕсли;
			Иначе
				Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник.абс_ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
					Источник.абс_УровеньСогласования=0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.абс_ВводБюджета") Тогда
		Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Источник.Организация,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета,Источник.Дата) Тогда
			Если Источник.ЭтоНовый() Тогда
				МаршрутСогласования=абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Источник.ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ВводБюджета);
				Если Не МаршрутСогласования.Пустая() Тогда 
					Источник.ЭтапСогласования=МаршрутСогласования;
					Источник.УровеньСогласования=МаршрутСогласования.Уровень() + 1;
				КонецЕсли;
			Иначе
				Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник.ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
					Источник.УровеньСогласования=0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.абс_ЗаявкаНаБюджетОтделаТМ") Тогда
		Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Источник.Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ,Источник.Дата) Тогда
			Если Источник.ЭтоНовый() Тогда
				МаршрутСогласования=абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Источник.ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ);
				Если Не МаршрутСогласования.Пустая() Тогда 
					Источник.ЭтапСогласования=МаршрутСогласования;
					Источник.УровеньСогласования=МаршрутСогласования.Уровень() + 1;
				КонецЕсли;
			Иначе
				Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник.ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
					Источник.УровеньСогласования=0;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник)=Тип("ДокументОбъект.абс_СтратегическиеЦелиПродаж") Тогда
		Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Источник.Организация,Перечисления.абс_ТипыДокументовДляСогласования.СтратегическиеЦелиПродаж,Источник.Дата) Тогда
			Если Источник.ЭтоНовый() Тогда
				МаршрутСогласования=абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(Неопределено,Перечисления.абс_ТипыДокументовДляСогласования.СтратегическиеЦелиПродаж);
				Если Не МаршрутСогласования.Пустая() Тогда 
					Источник.ЭтапСогласования=МаршрутСогласования;
					Источник.УровеньСогласования=МаршрутСогласования.Уровень() + 1;
				КонецЕсли;
			Иначе
				Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
					Источник.ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
					Источник.УровеньСогласования=0;
				КонецЕсли;	
			Конецесли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьДоступностьРедактирования(Док,ФормаДок) Экспорт
	Если Док.Состояние=Перечисления.СостоянияОбъектов.Утвержден Или
			Док.Состояние=Перечисления.СостоянияОбъектов.Согласован Тогда
		ФормаДок.ТолькоПросмотр=Истина;
	Иначе
		ФормаДок.ТолькоПросмотр=Ложь;
	КонецЕсли;
	Если ТипЗнч(Док)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") И РольДоступна("абс_Финансист") Тогда
		ФормаДок.ТолькоПросмотр=Ложь;
	КонецЕсли;	
	
	Если ТипЗнч(Док)=Тип("ДокументСсылка.абс_ВводБюджета") 
		ИЛИ ТипЗнч(Док)=Тип("ДокументСсылка.абс_ЗаявкаНаБюджетОтделаТМ")
		ИЛИ ТипЗнч(Док)=Тип("ДокументСсылка.абс_СтратегическиеЦелиПродаж") Тогда
		Если Док.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
			ФормаДок.Элементы.ГруппаШапка.ПодчиненныеЭлементы.ГруппаШапкаПраво.ПодчиненныеЭлементы.Состояние.КнопкаВыбора=Истина;
			ФормаДок.Элементы.ГруппаШапка.ПодчиненныеЭлементы.ГруппаШапкаПраво.ПодчиненныеЭлементы.Состояние.Доступность=Истина;
			ФормаДок.Элементы.ГруппаШапка.ПодчиненныеЭлементы.ГруппаШапкаПраво.ПодчиненныеЭлементы.Состояние.ТолькоПросмотр=Ложь;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Док)=Тип("ДокументСсылка.ПланПродаж")
		ИЛИ ТипЗнч(Док)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
		Если Док.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
			ФормаДок.ЭлементыФормы.Состояние.Доступность=Истина;
			ФормаДок.ЭлементыФормы.Состояние.ТолькоПросмотр=Ложь;
			ФормаДок.ЭлементыФормы.Состояние.ДоступныеЗначения.Очистить();
			ФормаДок.ЭлементыФормы.Состояние.ДоступныеЗначения.Добавить(Перечисления.СостоянияОбъектов.Подготовлен);
			ФормаДок.ЭлементыФормы.Состояние.ДоступныеЗначения.Добавить(Перечисления.СостоянияОбъектов.Отклонен);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыДляСогласованияДокумента(ДокументДляСогласования, НовоеСостояние, Пользователь) Экспорт
	
	ЭтапыСогласования = абс_СогласованиеДокументов.ПолучитьЭтапыСогласованияПользователя(Пользователь);
	СписокЭтапов = абс_СогласованиеДокументов.ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования, Пользователь);
   
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СостоянияСогласования.Состояние КАК ТекущееСостояние,
	|	СостоянияСогласования.Этап КАК Этап,
	|	СостоянияСогласования.Уровень КАК Уровень,
	|	СостоянияСогласования.Пользователь КАК ПоследнийСогласующий,
	|	СостоянияСогласования.ДокументДляСогласования.Ссылка КАК ДокументДляСогласования,
	|	СостоянияСогласования.ДокументДляСогласования.СуммаДокумента КАК СуммаДокумента,
	|	СостоянияСогласования.ДокументДляСогласования.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_ВводБюджета)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.ЦФО
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_ЗаявкаНаБюджетОтделаТМ)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.ЦФО
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.ЗаявкаНаРасходованиеСредств)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.ЦФО
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_СтратегическиеЦелиПродаж)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.Лео_ЗаявкаНаЗапчасти)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.ЦФО
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.ПланПродаж)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Подразделение
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.поступлениеТоваровУслуг)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Подразделение

	|	   КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.Лео_ЗаявкаНаАкцию)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Подразделение
	|	КОНЕЦ КАК ЦФО,
	|	СостоянияСогласования.ДокументДляСогласования.Ответственный КАК Ответственный,
	|	СостоянияСогласования.ДокументДляСогласования.Дата КАК Дата,
	|	СостоянияСогласования.ДокументДляСогласования.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_ВводБюджета)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.СценарийПродаж
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_ЗаявкаНаБюджетОтделаТМ)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.абс_СтратегическиеЦелиПродаж)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Сценарий
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.ПланПродаж)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Сценарий
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.ЗаявкаНаРасходованиеСредств)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Сценарий
	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.Лео_ЗаявкаНаЗапчасти)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
		|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.Лео_ЗаявкаНаАкцию)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СценарииПланирования.ПустаяСсылка)
     |		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.ПоступлениеТоваровУслуг)
	|	     ТОГДА СостоянияСогласования.ДокументДляСогласования.Сценарий

	|		КОГДА ТИПЗНАЧЕНИЯ(СостоянияСогласования.ДокументДляСогласования) = ТИП(Документ.Лео_ФиксацияСкидокПоТрейдМаркетингу)
	|			ТОГДА СостоянияСогласования.ДокументДляСогласования.Сценарий
	|	КОНЕЦ КАК Сценарий,
	|	ИСТИНА КАК Пометка
	|ИЗ
	|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &ДокументДляСогласования) КАК СостоянияСогласования
	|ГДЕ
	|	СостоянияСогласования.Этап В(&ЭтапыМаршрутовВКоторыхУчаствуетПользователь)";
	
	Запрос.УстановитьПараметр("ДокументДляСогласования", ДокументДляСогласования);
	Запрос.УстановитьПараметр("ЭтапыМаршрутовВКоторыхУчаствуетПользователь", СписокЭтапов);
	
	ДокументыДляСогласования = Запрос.Выполнить().Выгрузить();
	
	Если ДокументыДляСогласования.Количество()>0 Тогда
	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ДокументДляСогласования);
		ПараметрыФормы.Вставить("НовоеСостояние", НовоеСостояние);
		ПараметрыФормы.Вставить("ДокументыДляСогласования", ДокументыДляСогласования);
		
		СвойстваОбъекта = Новый Структура;
		СвойстваОбъекта.Вставить("ТекущийПользователь",  Пользователь);
		СвойстваОбъекта.Вставить("ПроизвольныйОтчет",    Неопределено);
		СвойстваОбъекта.Вставить("СохраненнаяНастройка", Неопределено);
		
		ПараметрыФормы.Вставить("СвойстваОбъекта",  СвойстваОбъекта);
		
	Иначе
		ПараметрыФормы = Неопределено;
	КонецЕсли;
	
	Возврат ПараметрыФормы;
	
КонецФункции

Функция ПолучитьЭтапыСогласованияПользователя(Пользователь) Экспорт
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.абс_МаршрутыСогласованияДокументов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь
	               |			И (МаршрутыСогласованияСогласующиеЛица.ДатаДействия = ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЛИ МаршрутыСогласованияСогласующиеЛица.ДатаДействия >= &ТекДата)";
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекПользователь", Пользователь);
	Запрос.УстановитьПараметр("ТекДата", НачалоДня(ТекущаяДата()));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции //

Функция ПолучитьЭтапыМаршрутовВКоторыхУчаствуетПользователь(ЭтапыСогласования, Пользователь) Экспорт
	
	СписокЭтапов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласования.Ссылка КАК ЭтапСогласования
	               |ИЗ
	               |	Справочник.абс_МаршрутыСогласованияДокументов КАК МаршрутыСогласования
	               |ГДЕ
	               |	МаршрутыСогласования.Ссылка В ИЕРАРХИИ (&ЭтапыСогласования)";
	 
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЭтапыСогласования", ЭтапыСогласования);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокЭтапов.Добавить(Выборка.ЭтапСогласования);
	КонецЦикла;
	
	Возврат СписокЭтапов
	
КонецФункции // 

Процедура абс_ПриПроведенииДокументовОплатПоЗРСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	МассивЗРС = Новый Массив;
	
	Если 	ТипИсточника = Тип("ДокументОбъект.ПлатежноеПоручениеИсходящее") 			ИЛИ ТипИсточника = Тип("ДокументСсылка.ПлатежноеПоручениеИсходящее") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПлатежныйОрдерСписаниеДенежныхСредств") 	ИЛИ ТипИсточника = Тип("ДокументСсылка.ПлатежныйОрдерСписаниеДенежныхСредств") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПлатежноеТребованиеПолученное") 			ИЛИ ТипИсточника = Тип("ДокументСсылка.ПлатежноеТребованиеПолученное") Тогда
		
		Для Каждого СтрПлатежа Из Источник.РасшифровкаПлатежа Цикл
			Если ЗначениеЗаполнено(СтрПлатежа.ДокументПланированияПлатежа) Тогда
				МассивЗРС.Добавить(СтрПлатежа.ДокументПланированияПлатежа);
			КонецЕсли;		
		КонецЦикла;	
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаДолга") ИЛИ ТипИсточника = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		
		Если ЗначениеЗаполнено(Источник.абс_ЗаявкаНаРасходованиеСредств) Тогда
			МассивЗРС.Добавить(Источник.абс_ЗаявкаНаРасходованиеСредств);
		КонецЕсли;		
		
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РеализацияТоваровУслуг") ИЛИ ТипИсточника = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда		
		
		Если ЗначениеЗаполнено(Источник.абс_ЗаявкаНаРасходованиеСредств) Тогда
			МассивЗРС.Добавить(Источник.абс_ЗаявкаНаРасходованиеСредств);
		КонецЕсли;		
		
	КонецЕсли;
	
	УстановитьСтатусЗРС(МассивЗРС, Перечисления.СостоянияОбъектов.абс_Проведен, Отказ);
	
КонецПроцедуры

Процедура УстановитьСтатусЗРС(СписокЗРС, НовыйСтатус, Отказ)
		
	Для Каждого ТекЗРС Из СписокЗРС Цикл
		
		Если НЕ ТипЗнч(ТекЗРС) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТекЗРС) Тогда
			Продолжить;
		КонецЕсли;	
	
		Если НЕ абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(ТекЗРС.Организация, Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаРасходованиеСредств, ТекЗРС.Дата) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТекЗРС.Состояние = НовыйСтатус Тогда
			Продолжить;
		КонецЕсли;
		
		НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(ТекЗРС);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		ЗРС = ТекЗРС.ПолучитьОбъект();
		
		ЗРС.Состояние = НовыйСтатус;
		
		Попытка
			ЗРС.Записать(РежимЗаписиДокумента.Запись);
			
			НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
			
			НоваяЗапись.Период 					= ТекущаяДата();
			НоваяЗапись.Активность 				= Истина;
			НоваяЗапись.ДокументДляСогласования = ТекЗРС;
			НоваяЗапись.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
			НоваяЗапись.Этап 					= НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество() - 1].Этап;
			НоваяЗапись.Уровень 				= НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество() - 1].Уровень;
			НоваяЗапись.Состояние 				= НовыйСтатус;
		
			НаборЗаписейСостояниеСогласования.Записать();
			
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке("Ошибка при установке статуса " + НовыйСтатус + " в заявке на расходование средств " + ТекЗРС + "!" + Символы.ПС + ОписаниеОшибки(), Отказ);
		КонецПопытки;
		
	КонецЦикла;	
	
КонецПроцедуры


Процедура Лео_РегистрСведенийСостояниеСогласованиеПриЗаписиПриЗаписи(Источник, Отказ, Замещение) Экспорт
	//Для Каждого Строка из Источник Цикл
	//	Если ТипЗнч(Строка.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ЗаявкаНаАкцию") Тогда  
	//		Для Каждого СтрокаИсполнителя из Строка.Этап.СогласующиеЛица Цикл
	//			
	//			НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
	//			НоваяЗадача.Дата			= НачалоДня(Строка.Период);
	//			НоваяЗадача.ВидЗадачи	= Справочники.ВидыЗадачПользователей.Согласование;
	//			НоваяЗадача.ОбъектЗадачи	= Строка.ДокументДляСогласования;
	//			НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(Строка.ДокументДляСогласования));
	//			НоваяЗадача.Исполнитель	= СтрокаИсполнителя.Пользователь;
	//			
	//			//УправлениеЗадачами.ЗаписатьАдресациюЗадачи(НоваяЗадача, Строка.ДокументДляСогласования.Организация, СтрокаИсполнителя.Пользователь);
	//			НоваяЗадача.Записать();
	//			
	//		КонецЦикла;	
	//	КонецЕсли;		
	//КонецЦикла;	
	
	
КонецПроцедуры
